python/some_python_phenomenon.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>some_python_phenomenon</title>
<!-- 2016-11-27 Sun 15:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">some_python_phenomenon</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. loop</a>
<ul>
<li><a href="#sec-1-1">1.1. code</a></li>
<li><a href="#sec-1-2">1.2. analysis</a></li>
</ul>
</li>
<li><a href="#sec-2">2. bool</a>
<ul>
<li><a href="#sec-2-1">2.1. code</a></li>
<li><a href="#sec-2-2">2.2. analysis</a></li>
</ul>
</li>
<li><a href="#sec-3">3. hash</a>
<ul>
<li><a href="#sec-3-1">3.1. code</a></li>
<li><a href="#sec-3-2">3.2. analysis</a></li>
</ul>
</li>
<li><a href="#sec-4">4. int</a>
<ul>
<li><a href="#sec-4-1">4.1. analysis</a></li>
</ul>
</li>
<li><a href="#sec-5">5. tuple</a>
<ul>
<li><a href="#sec-5-1">5.1. code</a></li>
<li><a href="#sec-5-2">5.2. analysis</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> loop</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> code</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python">&gt;items():pass
&gt;
&gt;y
&gt;{'a': 1, 'b': 2}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> analysis</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python">&gt;x.iterms()  # (('a', 1), ('b', 2))
&gt;k = 'a'
&gt;y['a'] = 1
&gt;pass
&gt;k = 'b'
&gt;y['b'] = 2
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> bool</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> code</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-python">&gt;"Hello" + True
&gt;TypeError: Can't convert 'bool' object to str implicitly
&gt;"Hello" * True
&gt;'Hello'
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> analysis</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-python">&gt;int(True)  # True 真實值爲1，參見python C源碼定義, True就是整型的特殊值.
&gt;1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> hash</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> code</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-python">&gt;def greet(): return
&gt;d = {greet: 1}
&gt;d
&gt;{&lt;function __main__.greet&gt;: 1}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> analysis</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-python">&gt;hasattr(greet, '__hash__')  # True
&gt;greet.__hash__()  # -9223363285414220592
</pre>
</div>
<p>
function 是可哈希的，在其生成的一瞬間，就已經固定不變，包括其中參數的id
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> int</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-python">&gt;x = 1
&gt;y = 1
&gt;x is y
&gt;True
&gt;x = 999
&gt;y = 999
&gt;x is y
&gt;False
</pre>
</div>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> analysis</h3>
<div class="outline-text-3" id="text-4-1">
<p>
詭異？
其實python在初始化的時候就把一部分整型對象生成好了(這個叫小整型對象池)，
但是不可能所有的都生成，官方會測試出一個最佳值來在源碼中寫死;
大於其值，則重新生成，小於等於則直接返回給你，所以，你懂得.
999明顯大於，而1,明顯是直接返回的，只是內部引用增加了而已
正常編譯應該是[-5,256].
測試代碼:
</p>
<div class="org-src-container">

<pre class="src src-python"># 1)
&gt;x = -5
&gt;x is int(str(x))  # False
# 2)
&gt;test_int = lambda x: x is int(str(x))
&gt;test_int(256)  # True
# [-5, 256] return True
# &lt;=-6, &gt;=257  return False
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> tuple</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> code</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-python">&gt;a = [1, 0]
&gt;a[0], a[a[0]] = a[a[0]], a[0]
&gt;a
&gt;[1, 0]
&gt;a[a[0]], a[0] = a[0], a[a[0]]
&gt;a
&gt;[0, 1]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> analysis</h3>
<div class="outline-text-3" id="text-5-2">
<p>
不好理解？其實就是表達式看起來復雜了點兒，道理很簡單,看代碼
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;a[0], a[a[0]] = a[a[0]], a[0]
&gt;&gt;a[0] = a[a[0]]; a[a[0]] = a[0]
# 其實，這個時候最後一個a[0] 可以確定是1了，而第二個a[a[0]], 是a[0]賦值過一次之後才得到a[0]
&gt;&gt;&gt;a[0] = a[1]  # a[0]=0;  a[0] = 1  # a--&gt;[1, 0]
# 這個好理解
&gt;a[a[0]], a[0] = a[0], a[a[0]]
&gt;&gt;a[1] = 1; a[0] = a[1]  # a--&gt;[0, 1]
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-11-27 Sun 15:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
